#Написать программу которая будет принимать на вход число N и выводить числа от -N до N
n = int (input())
print (list(range(-n, n+1)))
